/* Имя оператора по умолчанию, если не подгрузилась информация */
"agent_name_default" = "Agent";

/* Надпись к сообщениям клиента */
"agent_name_you" = "You";

"Agent.DisplayName.Deleted" = "Deleted agent";

"Camera.Access.Description" = "This app needs permission to use your camera";

/* Normally user iOS device doesn't return "Restricted" camera access status. But for test purposes we've added an alert with this string message anyway. */
"Camera.Access.Restricted" = "Camera access denied";

"Camera.Access.Suggestion" = "We need your permission to be able to take photos and share them";

/* Alert with this message displays when you try to take a photo from camera on iOS simulator or when real device experiencing some technical issues. */
"Camera.Access.Unavailable" = "Camera is unavailable";

"chat_input.status.contact_info" = "Fill the contact form above";

/* Подзаголовок окна чата по умолчанию */
"chat_subtitle_placeholder" = "Chat with us 24/7!";

/* Системное сообщение в ленте чата, говорящее о том, что произошел разрыв соединения  с сервером. */
"chat_system_disconnected" = "Network error code: %d, error message: %s";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент несколько агентов набирают сообщение. */
"chat_system_few_agents_typing" = "%s, %s and +%d are typing...";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент один агент набирает сообщение. */
"chat_system_one_agent_typing" = "%s is typing...";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент два агента набирают сообщение. */
"chat_system_two_agents_typing" = "%s and %s are typing...";

/* Заголовок окна чата по умолчанию */
"chat_title_placeholder" = "Report an issue";

"Chat.History.LoadMore" = "Load more history";

"chat.state_unavailable.discription" = "Live chat is temporarily unavailable at the moment. Please try again later.";

"chat.state_unavailable.title" = "Chat is temporarily unavailable";

"chat.system.contact_form.introduce_in_chat" = "Please introduce yourself in chat";

"chat.system.contact_form.must_fill" = "Please fill in your contact information to send this message";

"chat.system.contact_form.status_sent" = "Your message is being sent over to the team. They'll be in touch soon. ";

"Chat.System.Media.Preparing" = "Preparing the file...";

"Chat.System.Media.Uploading" = "Sending the file...";

"Chat.System.NewMessages" = "New messages";

"Client.Title" = "Client #%d";

/* Общая строка "Отмена" */
"common_cancel" = "Cancel";

"common_close" = "Close";

"common_done" = "Done";

"common_understand" = "Got it!";

/* Универсальное сообщение о неизвестной ошибке. */
"common_unknown_error" = "Unknown error";

"Common.Open" = "Open";

"common.send" = "Send";

"Common.Settings" = "Settings";

/* Состояние подключения к сервису */
"connection_state_connecting" = "Connecting…";

/* Состояние отсутствия подключения */
"connection_state_disconnected" = "Connection failed, retry in %d seconds";

/* Кнопка для повторного подключения к сервису, не дожидаясь таймаута  */
"connection_state_retry" = "Retry immediately";

"contact_form.email.placeholder" = "Your email";

"contact_form.name.placeholder" = "Your name";

"contact_form.phone.placeholder" = "Your phone";

"contact_form.status.sent" = "Thank you!";

/* Статус загрузки - ошибка */
"download_status_error" = "Error";

/* Статус загрузки - загрузка */
"download_status_loading" = "Uploading...";

/* Ошибка загрузки файла, если ссылка устарела. */
"file_download_expired" = "Link has expired";

/* Message letting user know that file is unavailable for download. */
"file_download_unavailable" = "File not available";

/* Проверка ссылки на файл */
"file_link_checking" = "Checking...";

/* Default file name */
"file_name_unknown" = "Untitled file";

"file_transfer_disabled" = "File transfer disabled";

/* Формат для размера файла в байтах */
"format_file_size_b" = "%.0f B";

/* Формат для размера файла в килобайтах */
"format_file_size_kb" = "%.0f KB";

/* Формат для размера файла в мегабайтах */
"format_file_size_mb" = "%.2f MB";

/* Подсказка в окне ввода сообщения */
"input_message_placeholder" = "Enter your message...";

"jivo_business_messenger" = "Business Messenger by";

"JV_ChatInput_MenuAttach_Camera" = "Camera";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку открывает системный пикер документов. */
"JV_ChatInput_MenuAttach_Document" = "Document";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку вызывает пикер фотогалереи. */
"JV_ChatInput_MenuAttach_Gallery" = "Gallery";

/* Подсказка в окне ввода сообщения */
"JV_ChatInput_Message_Placeholder" = "Enter your message...";

"JV_ChatInput_Status_FillContactForm" = "Fill the contact form above";

/* Подзаголовок окна чата по умолчанию */
"JV_ChatNavigation_HeaderSubtitle_Default" = "Chat with us 24/7!";

/* Заголовок окна чата по умолчанию */
"JV_ChatNavigation_HeaderTitle_Default" = "Report an issue";

"JV_ChatScreen_PlaceholderUnavailable_Body" = "Live chat is temporarily unavailable at the moment. Please try again later.";

"JV_ChatScreen_PlaceholderUnavailable_Headline" = "Chat is temporarily unavailable";

/* Пункт "Копировать" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"JV_ChatTimeline_MessageAction_Copy" = "Copy";

"JV_ChatTimeline_MessageAction_Delete" = "Delete";

/* Пункт "Повторить отправку" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"JV_ChatTimeline_MessageAction_Resend" = "Resend";

"JV_ChatTimeline_MessageStatus_Deleted" = "Message was deleted";

"JV_ChatTimeline_MessageStatus_Edited" = "(edited)";

"JV_ChatTimeline_SystemButton_LoadMore" = "Load more history";

"JV_ChatTimeline_SystemIndicator_NewMessages" = "New messages";

"JV_ChatTimeline_SystemMessage_ContactInfoSent" = "Your message is being sent over to the team. They'll be in touch soon.";

"JV_ChatTimeline_SystemMessage_MediaUploading" = "Sending the file...";

"JV_ChatTimeline_SystemMessage_OfflineDefault" = "Oops, it seems that our agents are not available now. You can leave your message here in chat and they will contact you soon.";

"JV_ChatTimeline_SystemMessage_SecondLine" = "The chat was transferred to the second line";

/* Общая строка "Отмена" */
"JV_Common_Captions_Cancel" = "Cancel";

"JV_Common_Captions_Close" = "Close";

"JV_Common_Captions_Open" = "Open";

"JV_Common_Captions_Send" = "Send";

"JV_Common_Captions_Settings" = "Settings";

"JV_Common_Captions_Understand" = "Got it!";

/* Универсальное сообщение о неизвестной ошибке. */
"JV_Common_Captions_UnknownError" = "Unknown error";

"JV_ContactForm_EmailField_Placeholder" = "Your email";

"JV_ContactForm_Legend_FillDesired" = "Please introduce yourself in chat";

"JV_ContactForm_Legend_FillRequired" = "Please fill in your contact information to send this message";

"JV_ContactForm_NameField_Placeholder" = "Your name";

"JV_ContactForm_PhoneField_Placeholder" = "Your phone";

"JV_ContactForm_SubmitStatus_Done" = "Thank you!";

/* Имя оператора по умолчанию, если не подгрузилась информация */
"JV_DisplayName_Agent_Default" = "Agent";

"JV_DisplayName_Bot_Default" = "bot";

"JV_DisplayName_Client_DefaultFormat" = "Client #%d";

"JV_DisplayName_Sender_You" = "You";

/* Ошибка загрузки файла, если ссылка устарела. */
"JV_FileAttachment_LinkStatus_Expired" = "Link has expired";

/* Message letting user know that file is unavailable for download. */
"JV_FileAttachment_LinkStatus_Unavailable" = "File not available";

/* Unsupported file type */
"JV_FileAttachment_Status_Unsupported" = "This file type is not supported";

/* Ошибка, возникающая при неудачной подготовке файла к загрузке. */
"JV_FileTransfer_Status_FailedPreparing" = "Failed to prepare the file";

"JV_FileTransfer_Status_FailedUploading" = "Failed to upload the file";

/* Превышение лимита выгружаемого файла */
"JV_FileTransfer_Status_TooLarge" = "File size must not exceed %dMB";

"JV_Notification_MainChannel_InfoBrief" = "Message from Jivo SDK";

"JV_Notification_MainChannel_InfoName" = "Jivo";

/* Format for text message where $1 is agent name, $2 - text message */
"JV_Notification_MainChannel_MessageBody" = "%1$s: %2$s";

"JV_Notification_MainChannel_MessageHeadline" = "Support";

"JV_RateForm_CommentField_Legend" = "Your comment";

"JV_RateForm_HeaderSubtitle_BeforeSubmission" = "How satisfied are you with the agent's answers?";

"JV_RateForm_HeaderSubtitle_NegativeSubmission" = "We strive to do the best service for you. We have something to work on.";

"JV_RateForm_HeaderSubtitle_PositiveSubmission" = "We are glad that you liked it";

"JV_RateForm_HeaderTitle_AfterSubmission" = "Thank you for your feedback!";

"JV_RateForm_HeaderTitle_BeforeSubmission" = "Leave review";

"JV_RateForm_SubmitButton_Caption" = "Send";

"JV_SpecialMenu_Popup_ExportAction" = "Export Logs";

"JV_SpecialMenu_Popup_ExportJournal" = "Tech Journal";

"JV_SpecialMenu_Popup_Title" = "Special Menu";

/* Normally user iOS device doesn't return "Restricted" camera access status. But for test purposes we've added an alert with this string message anyway. */
"JV_SystemAccess_Camera_NoPermission" = "Camera access denied";

/* Alert with this message displays when you try to take a photo from camera on iOS simulator or when real device experiencing some technical issues. */
"JV_SystemAccess_Camera_NoSource" = "Camera is unavailable";

"JV_SystemAccess_Camera_RequestReason" = "We need your permission to be able to take photos and share them";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway., If there is an error then the alert should be displayed on photo library access try when starting to pick images. */
"JV_SystemAccess_Gallery_NoContent" = "No available images";

"JV_SystemAccess_Gallery_NoPermission" = "Please Allow Access";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway */
"JV_SystemAccess_Gallery_NoSource" = "Photo library is unavailable";

"JV_SystemAccess_Gallery_RequestReason" = "We need access to your photo library to send photos and videos.";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку открывает системный пикер документов. */
"media_upload_attachment_type_selecting_document" = "Document";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку вызывает пикер фотогалереи. */
"media_upload_attachment_type_selecting_photo" = "Gallery";

/* Заголовок с вопросом о том, какой тип вложения пользователь хочет прикрепить к сообщению. */
"media_upload_select_an_attachment_type_title" = "What would you like to attach?";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент ведётся загрузка файла на сервер. */
"media_upload_sending_the_file" = "Sending the file";

"media_uploading_common_error" = "Failed to upload the file";

/* Ошибка, возникающая при неудачной подготовке файла к загрузке. */
"media_uploading_extraction_error" = "Failed to prepare the file";

/* Превышение лимита выгружаемого файла */
"media_uploading_too_large" = "File size must not exceed %dMB";

"Media.Access.Missing" = "Please Allow Access";

"Media.Access.Suggestion" = "JivoChat needs access to your photo library to send photos and videos.\n\nPlease go to [Settings > Your App > Photos] to give access.";

"Media.Picker.Camera" = "Camera";

/* Пункт меню "Копировать ссылку" */
"menu_action_copy" = "Copy link";

/* Пункт меню "Cкачать" */
"menu_action_download" = "Download";

"Menu.Action.File" = "File";

/* Кнопка скачать для прикрепленного документа/файла */
"message_download" = "Download";

/* Системное сообщение о присоединении оператора к чату */
"message_system_operator_accepted" = "Agent joined the chat";

/* Unsupported file type */
"message_unsupported_media" = "This file type is not supported";

"Message.Deleted" = "Message was deleted";

"Message.Edited" = "(edited)";

"Message.Preview.Line" = "The chat was transferred to the second line";

"Message.Sender.You" = "You";

"messages.label.bot" = "bot";

"notification_channel_message_description" = "Message from Jivo SDK";

"notification_channel_message_name" = "Jivo";

/* Format for text message where $1 is agent name, $2 - text message */
"notification_message_text_format" = "%1$s: %2$s";

"notification_message_title" = "Support";

"offline_message_placeholder" = "Oops, it seems that our agents are not available now. You can leave your message here in chat and they will contact you soon.";

/* Пункт "Копировать" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"options_copy" = "Copy";

"options_delete" = "Delete";

/* Пункт "Повторить отправку" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"options_resend" = "Resend";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway., If there is an error then the alert should be displayed on photo library access try when starting to pick images. */
"PhotoLibrary.Access.NoAvailableImages" = "No available images";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway */
"PhotoLibrary.Access.Unavailable" = "Photo library is unavailable";

"rate_form.comment_title" = "Your comment";

"rate_form.description" = "How satisfied are you with the agent's answers?";

"rate_form.finish_description_bad" = "We strive to do the best service for you. We have something to work on.";

"rate_form.finish_description_good" = "We are glad that you liked it";

"rate_form.finish_title" = "Thank you for your feedback!";

"rate_form.send" = "Send";

"rate_form.title" = "Leave review";

"status_missing_connection" = "No connection";

"suggest_check_internet_access" = "Please check your Internet connection";

"toast_copied_to_clipboard" = "Copied";

/* Unsupported message type bubble discription */
"unsupported_message_description" = "The app version is outdated. Message details: %s";

/* postfix */
"unsupported_message_postfix" = "show more \u0020";

/* Title for unsupported message bubble  */
"unsupported_message_title" = "Unsupported message type";

/* Приветственное сообщение для пустого чата */
"welcome_message_placeholder" = "Chat with our customer support team and let us know if there's any bugs we can fix";

